//입력받은 숫자의 부호표시하기
// let a = prompt("숫자하나 입력");
// if (a>0){
//   {alert(1)}
// elif (a<0) {
//   {alert(-1)}
// else (a==0)
//   {alert(0)}
// }

// ==============================
//     정답
    // 1.prompt,숫자
    // 2.elif가 아니라 else if인가보다
    // 3.alert앞에 {}는 사용하지 않나보다
    // 4.alert문마다;사용하네
// ==============================

let value = prompt('숫자를 입력하세요.', 0);

if (value > 0) {
  alert( 1 );
} else if (value < 0) {
  alert( -1 );
} else {
  alert( 0 );
}

//'if'를 '?'로 교체하기
// let results;

// if(a + b <4) ? result = '미만':result = '이상' ;

// ==============================
// 정답
// ==============================
let result = (a + b < 4) ? '미만' : '이상';


//'if..else'를 '?'로 교체하기
// let message = (login == '직원') ? '안녕하세요.': (login == '임원')? '환영합니다.': login == ''? '로그인이 필요합니다.':'';

// ============================================
//     정답 : 조건부 연산자 1개씩 배열하는게 보기좋네
// ============================================
let message = (login == '직원') ? '안녕하세요.' :
  (login == '임원') ? '환영합니다.' :
  (login == '') ? '로그인이 필요합니다.' :
  '';